Revit 2024 API
DimensionType.SetOrdinateDimensionSetting Method
 Sets the ordinate dimension settings for this DimensionType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017 Subscription Update
Syntax
C#
public void SetOrdinateDimensionSetting(
	OrdinateDimensionSetting ordinateDimSetting
)
Visual Basic
Public Sub SetOrdinateDimensionSetting ( _
	ordinateDimSetting As OrdinateDimensionSetting _
)
Visual C++
public:
void SetOrdinateDimensionSetting(
	OrdinateDimensionSetting^ ordinateDimSetting
)
Parameters
ordinateDimSetting
Type: Autodesk.Revit.DB.OrdinateDimensionSetting
 The new ordinate dimension settings.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The origin tick mark id in the Ordinate Dimension Setting is invalid for the dimension style.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  This DimensionType cannot be assigned ordinate dimension settings, as it is not a linear DimensionType or its Dimension String Type parameter is not set to Ordinate.
See Also
DimensionType Class
Autodesk.Revit.DB Namespace